style: apply cargo fmt to all files
